//==================================================================================================================================//
//!< @file		State.h
//!< @brief		Stateクラスヘッダ
//!< @author	haga
//==================================================================================================================================//

#ifndef STATE_H
#define STATE_H

template <typename entry_type>
class State
{

public:
	/**Constructor*/
	State() = default;

	/**Destructor*/
	virtual ~State() =default;

	/**
	* 開始関数
	* @param pType	このStateを使用するクラスのインスタンスへのポインタ
	*/
	virtual void Enter(entry_type* pType) = 0;

	/**
	* 実行関数
	* @param pType	このStateを使用するクラスのインスタンスへのポインタ
	*/
	virtual void Execute(entry_type* pType) = 0;

	/**
	* 終了関数
	* @param pType	このStateを使用するクラスのインスタンスへのポインタ
	*/
	virtual void Exit(entry_type* pType) = 0;

};

#endif	// STATE_H

//==================================================================================================================================//
//END OF FILE
//==================================================================================================================================//
