//============================================================================================================================//
//!< @file		Button.h
//!< @brief		Buttonクラスヘッダ
//!< @author	haga
//============================================================================================================================//

#ifndef BUTTON_H
#define BUTTON_H

/**
* ボタンの基底クラス
*/
class Button
{

public:
	/**Constructor*/
	Button() = default;

	/**Destructor*/
	virtual ~Button() = default;

	/**
	* コントロール関数
	* @return マウスカーソルがあたっているかどうか
	*/
	virtual bool Control() = 0;

	/**描画関数*/
	virtual void Draw() = 0;

	/**
	* VertexIDを取得する関数
	* @return VertexID
	*/
	virtual int GetVtxID() = 0;

	/**
	* ボタンの横幅を取得する関数
	* @return ボタンの横幅
	*/
	virtual float GetButtonWidth() = 0;

	/**
	* ボタンの縦幅を取得する関数
	* @return ボタンの縦幅
	*/
	virtual float GetButtonHeight() = 0;

};


#endif	// BUTTON_H

//======================================================================================================================//
//END OF FILE
//======================================================================================================================//
