//==================================================================================================================================//
//!< @file		GameDataManager.h
//!< @brief		GameDatamanagerクラスヘッダ
//!< @author	haga･matsuda
//==================================================================================================================================//

//--------------------------------------------------------------------------------------------------------------//
//Includes
//--------------------------------------------------------------------------------------------------------------//

#include "GameDataManager.h"

//--------------------------------------------------------------------------------------------------------------//
//Unnamed namespace
//--------------------------------------------------------------------------------------------------------------//

namespace
{

const	int			MoneyDefaultval			= 1000;			// 所持金のデフォルト値
const	int			FightOffDayLimitVal		= 10;			// 撃退日数期限

}

//--------------------------------------------------------------------------------------------------------------//
//Public functions
//--------------------------------------------------------------------------------------------------------------//

GameDataManager::GameDataManager()
	: m_Money(MoneyDefaultval)
	, m_FightOffDays(FightOffDayLimitVal)
	, m_WaveCount(1)
	, m_SelectedShipID()
{
	m_ShipAggressivity.m_Aggressivity[GameDataManager::ShipAggressivity::LV1] = 0;
	m_ShipDurability.m_Durability[GameDataManager::ShipDurability::LV1] = 0;
	m_ShipSpeed.m_Speed[GameDataManager::ShipSpeed::LV1] = 0;
}

GameDataManager::~GameDataManager()
{
}

void GameDataManager::ResetWaveData()
{
	m_FightOffDays = FightOffDayLimitVal;
	++m_WaveCount;
}

//==================================================================================================================================//
//END OF FILE
//==================================================================================================================================//
